cmsis-svd/cmsis-svd/data/Nuvoton/M253.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD7</name>
          <displayName>USBD_MXPLD7</displayName>
          <description>Endpoint 7 Maximal Payload Register</description>
          <addressOffset>0x574</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG7</name>
          <displayName>USBD_CFG7</displayName>
          <description>Endpoint 7 Configuration Register</description>
          <addressOffset>0x578</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP7</name>
          <displayName>USBD_CFGP7</displayName>
          <description>Endpoint 7 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x57C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG8</name>
          <displayName>USBD_BUFSEG8</displayName>
          <description>Endpoint 8 Buffer Segmentation Register</description>
          <addressOffset>0x580</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD8</name>
          <displayName>USBD_MXPLD8</displayName>
          <description>Endpoint 8 Maximal Payload Register</description>
          <addressOffset>0x584</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG8</name>
          <displayName>USBD_CFG8</displayName>
          <description>Endpoint 8 Configuration Register</description>
          <addressOffset>0x588</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP8</name>
          <displayName>USBD_CFGP8</displayName>
          <description>Endpoint 8 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x58C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG9</name>
          <displayName>USBD_BUFSEG9</displayName>
          <description>Endpoint 9 Buffer Segmentation Register</description>
          <addressOffset>0x590</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD9</name>
          <displayName>USBD_MXPLD9</displayName>
          <description>Endpoint 9 Maximal Payload Register</description>
          <addressOffset>0x594</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG9</name>
          <displayName>USBD_CFG9</displayName>
          <description>Endpoint 9 Configuration Register</description>
          <addressOffset>0x598</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP9</name>
          <displayName>USBD_CFGP9</displayName>
          <description>Endpoint 9 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x59C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG10</name>
          <displayName>USBD_BUFSEG10</displayName>
          <description>Endpoint 10 Buffer Segmentation Register</description>
          <addressOffset>0x5A0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD10</name>
          <displayName>USBD_MXPLD10</displayName>
          <description>Endpoint 10 Maximal Payload Register</description>
          <addressOffset>0x5A4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG10</name>
          <displayName>USBD_CFG10</displayName>
          <description>Endpoint 10 Configuration Register</description>
          <addressOffset>0x5A8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP10</name>
          <displayName>USBD_CFGP10</displayName>
          <description>Endpoint 10 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5AC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG11</name>
          <displayName>USBD_BUFSEG11</displayName>
          <description>Endpoint 11 Buffer Segmentation Register</description>
          <addressOffset>0x5B0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD11</name>
          <displayName>USBD_MXPLD11</displayName>
          <description>Endpoint 11 Maximal Payload Register</description>
          <addressOffset>0x5B4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG11</name>
          <displayName>USBD_CFG11</displayName>
          <description>Endpoint 11 Configuration Register</description>
          <addressOffset>0x5B8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP11</name>
          <displayName>USBD_CFGP11</displayName>
          <description>Endpoint 11 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5BC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG12</name>
          <displayName>USBD_BUFSEG12</displayName>
          <description>Endpoint 12 Buffer Segmentation Register</description>
          <addressOffset>0x5C0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD12</name>
          <displayName>USBD_MXPLD12</displayName>
          <description>Endpoint 12 Maximal Payload Register</description>
          <addressOffset>0x5C4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG12</name>
          <displayName>USBD_CFG12</displayName>
          <description>Endpoint 12 Configuration Register</description>
          <addressOffset>0x5C8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP12</name>
          <displayName>USBD_CFGP12</displayName>
          <description>Endpoint 12 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5CC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG13</name>
          <displayName>USBD_BUFSEG13</displayName>
          <description>Endpoint 13 Buffer Segmentation Register</description>
          <addressOffset>0x5D0</addressOffset>
       </register>
