cmsis-svd/cmsis-svd/data/Nuvoton/M253.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD13</name>
          <displayName>USBD_MXPLD13</displayName>
          <description>Endpoint 13 Maximal Payload Register</description>
          <addressOffset>0x5D4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG13</name>
          <displayName>USBD_CFG13</displayName>
          <description>Endpoint 13 Configuration Register</description>
          <addressOffset>0x5D8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP13</name>
          <displayName>USBD_CFGP13</displayName>
          <description>Endpoint 13 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5DC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG14</name>
          <displayName>USBD_BUFSEG14</displayName>
          <description>Endpoint 14 Buffer Segmentation Register</description>
          <addressOffset>0x5E0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD14</name>
          <displayName>USBD_MXPLD14</displayName>
          <description>Endpoint 14 Maximal Payload Register</description>
          <addressOffset>0x5E4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG14</name>
          <displayName>USBD_CFG14</displayName>
          <description>Endpoint 14 Configuration Register</description>
          <addressOffset>0x5E8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP14</name>
          <displayName>USBD_CFGP14</displayName>
          <description>Endpoint 14 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5EC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG15</name>
          <displayName>USBD_BUFSEG15</displayName>
          <description>Endpoint 15 Buffer Segmentation Register</description>
          <addressOffset>0x5F0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD15</name>
          <displayName>USBD_MXPLD15</displayName>
          <description>Endpoint 15 Maximal Payload Register</description>
          <addressOffset>0x5F4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG15</name>
          <displayName>USBD_CFG15</displayName>
          <description>Endpoint 15 Configuration Register</description>
          <addressOffset>0x5F8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP15</name>
          <displayName>USBD_CFGP15</displayName>
          <description>Endpoint 15 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5FC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG16</name>
          <displayName>USBD_BUFSEG16</displayName>
          <description>Endpoint 16 Buffer Segmentation Register</description>
          <addressOffset>0x600</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD16</name>
          <displayName>USBD_MXPLD16</displayName>
          <description>Endpoint 16 Maximal Payload Register</description>
          <addressOffset>0x604</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG16</name>
          <displayName>USBD_CFG16</displayName>
          <description>Endpoint 16 Configuration Register</description>
          <addressOffset>0x608</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP16</name>
          <displayName>USBD_CFGP16</displayName>
          <description>Endpoint 16 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x60C</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CANFDx</name>
      <description>CANFD Register Map</description>
      <groupName>CANFD</groupName>
      <baseAddress>0x40020000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0xC</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x58</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CANFD_DBTP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CANFD_DBTP</displayName>
          <description>Data Bit Timing Prescaler Register (P*)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000A33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSJW</name>
              <description>Data Re-Synchronization Jump Width </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data time segment after sample point</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTSEG1</name>
              <description>Data time segment before sample point</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBRP</name>
              <description>Data Bit Rate Prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDC</name>
              <description>Transmitter Delay Compensation</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Transmitter Delay Compensation Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Transmitter Delay Compensation Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CANFD_TEST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CANFD_TEST</displayName>
          <description>Test Register (P*)</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reset value, Loop Back Mode Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Loop Back Mode Enabled (refer to TEST Mode in the Operation Mode section)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reset value, CANx_TXD controlled by the CAN Core, updated at the end of the CAN bit time</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Point can be monitored at pin CANx_TXD</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Dominant ('0') level at pin CANx_TXD</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Recessive ('1') level at pin CANx_TXD</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>RX</name>
              <description>Receive Pin\nMonitors the actual value of pin CANx_RXD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The CAN bus is dominant (CANx_RXD = 0)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The CAN bus is recessive (CANx_RXD = 1)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CANFD_RWD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CANFD_RWD</displayName>
          <description>RAM Watchdog (P*)</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDC</name>
              <description>Watchdog Configuration \nStart value of the Message RAM Watchdog Counter. With the reset value of 00 the counter is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDV</name>
              <description>Watchdog Value \nActual Message RAM Watchdog Counter Value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
