cmsis-svd/cmsis-svd/data/Nuvoton/M253.svd
       <register>
          <name>EADC_SCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL0</displayName>
          <description>ADC Sample Module 0 Control Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>ADC Sample Module Channel Selection\n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>ADC External Trigger Rising Edge Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>ADC External Trigger Falling Edge Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYDIV</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency: </description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYCNT</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Time\nNote: If TRGDLYCNT is set to 1, trigger delay time is actually the same as TRGDLYCNT is set to 2 for hardware operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>ADC Sample Module Start of Conversion Trigger Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPOS</name>
              <description>Interrupt Flag Position Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC end of conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC start of conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen ADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, user can extend ADC sampling time after trigger source is coming to get enough sampling time. EXTSMPT can be set from 0~8'd251.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL1</name>
          <displayName>EADC_SCTL1</displayName>
          <description>ADC Sample Module 1 Control Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL2</name>
          <displayName>EADC_SCTL2</displayName>
          <description>ADC Sample Module 2 Control Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL3</name>
          <displayName>EADC_SCTL3</displayName>
          <description>ADC Sample Module 3 Control Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register>
          <name>EADC_SCTL16</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL16</displayName>
          <description>ADC Sample Module 16 Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen ADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend ADC sampling time after trigger source is coming to get enough sampling time. EXTSMPT can be set from 0~8'd255.\nThe range of start delay time is from 0~255 EADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
