cmsis-svd/cmsis-svd/data/Nuvoton/M253.svd
       <register>
          <name>EADC_PWRCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_PWRCTL</displayName>
          <description>EADC Power Management Control Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00F0C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READY</name>
              <description>EADC Start-up Completely and Ready for Conversion (Read Only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Power-on sequence is still in progress</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC is ready for conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTOFF</name>
              <description>Auto Off Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Auto off function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Auto off function Enabled. When AUTOFF is set to 1, EADC will be powered off automatically to save power</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STUPT</name>
              <description>EADC Start-up Time\nSet this bit fields to adjust start-up time. The minimum start-up time of EADC is 10us. </description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOPDTHT</name>
              <description>Auto Power Down Threshold Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>7</name>
                    <description>8 EADC clock for power down threshold time</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>16 EADC clock for power down threshold time</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>32 EADC clock for power down threshold time</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>64 EADC clock for power down threshold time</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>128 EADC clock for power down threshold time</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>256 EADC clock for power down threshold time</description>
                    <value>#1100</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_PDMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_PDMACTL</displayName>
          <description>EADC PDMA Control Register</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMATEN</name>
              <description>PDMA Transfer Enable Bit for External Channel\nWhen EADC conversion is completed, the converted data is loaded into EADC_DATn (n:0 ~ 3) register, user can enable this bit to generate a PDMA data transfer request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA data transfer Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA data transfer Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPDMATEN</name>
              <description>PDMA Transfer Enable Bit for Internal Channel\nWhen EADC conversion is completed, the converted data is loaded into EADC_DATn (n:17, 16) register, user can enable this bit to generate a PDMA data transfer request.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA data transfer Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA data transfer Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADC_M0CTL1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_M0CTL1</displayName>
          <description>EADC Sample Module0 Control Register 1</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALIGN</name>
              <description>Alignment Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The conversion result will be right aligned in data register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The conversion result will be left aligned in data register</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AVG</name>
              <description>Average Mode Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Conversion results will be stored in data register without averaging</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Conversion results in data register will be averaged</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ACU</name>
              <description>Number of Accumulated Conversion Results Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>1 conversion result will be accumulated</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>2 conversion result will be accumulated</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>4 conversion result will be accumulated</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>8 conversion result will be accumulated</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>16 conversion result will be accumulated</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>32 conversion result will be accumulated</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>64 conversion result will be accumulated</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>128 conversion result will be accumulated</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>256 conversion result will be accumulated</description>
                    <value>#1000</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_M0CTL1">
          <name>EADC_M1CTL1</name>
          <displayName>EADC_M1CTL1</displayName>
          <description>EADC Sample Module1 Control Register 1</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="EADC_M0CTL1">
          <name>EADC_M2CTL1</name>
          <displayName>EADC_M2CTL1</displayName>
          <description>EADC Sample Module2 Control Register 1</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="EADC_M0CTL1">
          <name>EADC_M3CTL1</name>
          <displayName>EADC_M3CTL1</displayName>
          <description>EADC Sample Module3 Control Register 1</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register>
          <name>EADC_OFFSETCAL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_OFFSETCAL</displayName>
          <description>ADC Result Offset Cancellation Register</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSETCANCEL</name>
              <description>ADC Offset Cancellation Trim Bits\nWhen CALEN(EADC_CTL[8]) is set to 1, the offset cancellation trim bits will compensate ADC result offset. When this bit is set to 0, the offset cancellation trim bits have no effect to ADC result.\nNote 1: These 5 bits trim value wouldn't latched into EADC_OFFSETCAL automatically when Flash initialization. User must read DCR2 by ISP command first, then write the value to OFFSETCANCEL. \nNote 2: OFFSETCANCEL is signed format. OFFSETCANCEL will sign extension to 12 bit by hardware to perform signed addition with EADC conversion result if CALEN is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
